Revit 2027 API
MEPNetworkIterator.SystemClassification Property
 The optional MEP system classification where the iterations are restricted.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MEPSystemClassification SystemClassification { get; set; }
Public Property SystemClassification As MEPSystemClassification
	Get
	Set
public:
property MEPSystemClassification SystemClassification {
	MEPSystemClassification get ();
	void set (MEPSystemClassification value);
}
member SystemClassification : MEPSystemClassification with get, set
Property Value
MEPSystemClassification
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
MEPNetworkIterator Class
Autodesk.Revit.DB.Analysis Namespace